<template>
  <ul class="patch-notes">
    <li class="patch-notes__patch-wrapper">
      <h3 class="patch-notes__patch-version">Версия 1.3.1</h3>
      <ol class="patch_notes__patch-features-wrapper">
        <li class="patch_notes__patch-feature">
          Был замечен баг, что при открытии модального окна ('Последние
          обновления') страница могла скролится (хотя не должна), в добавок к
          этому хедер страницы переставал быть 'sticky', а был привязан к верху
          до перезагрузки страницы. Теперь открытие любого модального окна
          блокирует прокрутку, а хедер после его закрытия остаётся 'sticky'
        </li>
      </ol>
    </li>
    <li class="patch-notes__patch-wrapper">
      <h3 class="patch-notes__patch-version">Версия 1.3.0</h3>
      <ol class="patch_notes__patch-features-wrapper">
        <li class="patch_notes__patch-feature">
          Для уменьшения нагрузки на количество чтений с базы (у нас квота на
          50000 чтений в сутки) было принято решение переделать структуру базы
          данных. Ранее в ней хранился массив из карт (1 документ - 1 карта). Но
          это не позволяло хранить несколько карт с одинаковым ID-шников для
          разных модов (например на одном турике карта была hr2, а на другом -
          fm2), а также это довольно быстро иcчерпывало квоту на чтения. Теперь
          в базе будет 21 документ ('nm1', 'nm2', ... 'tb'), каждый из которых
          содержит внутренний массив с картами. Например, если в категории 'nm1'
          есть 154 карты, то вместо 154 чтений будет потрачено только 1 чтение
        </li>
        <li class="patch_notes__patch-feature">
          Изменён компонент для загрузки карт (используется только в
          разработке). Ранее мы просто загружали карты в таблицу. Сейчас мы
          разбиваем входящий массив карт на 21 категорию (или меньше), а затем
          по одной пробуем вставить во внутренний массив категории. Если такой
          карты ещё нет там, то мы приплюсовываем её к концу существующего
          массива, а если есть - пропускаем.
        </li>
      </ol>
    </li>
    <li class="patch-notes__patch-wrapper">
      <h3 class="patch-notes__patch-version">Версия 1.2.0</h3>
      <ol class="patch_notes__patch-features-wrapper">
        <li class="patch_notes__patch-feature">
          Уменьшены внутренние отступы для страниц с таблицами карт скиллсетов
          (вертикальные - с 30px до 10px сверху и снизу; горизонтальные - с 20px
          до 10px слева и справа), а также уменьшено расстояние между заголовком
          ('Мапы ...') и самой таблицей (с 20px до 10px), что позволит
          одновременно разместить больше карт на экране без скроллинга
        </li>
        <li class="patch_notes__patch-feature">
          Ранее устройства с маленьким экраном (768px и меньше) использовали не
          всю доступную высоту для таблицы, теперь же добавлены уточняющие
          инструкции, и таблица теперь использует каждый доступный пиксель
          высоты
        </li>
        <li class="patch_notes__patch-feature">
          Для компонента загрузки карт (используется только в разработке) была
          организована отдельная папка (с самим компонентом и отдельным
          JSON-файлом), теперь для подготовки карт к загрузке достаточно нажать
          ctrl+A и ctrl+V в JSON-файле, что ускорит процесс загрузки карт (ранее
          приходилось искать переменную и вставлять массив карт в неё)
        </li>
      </ol>
    </li>
    <li class="patch-notes__patch-wrapper">
      <h3 class="patch-notes__patch-version">Версия 1.1.0</h3>
      <ol class="patch_notes__patch-features-wrapper">
        <li class="patch_notes__patch-feature">
          Высота таблиц с картами теперь адаптируется под доступную высоту
          страницы браузера устройства (ранее она была захардкожена в 425
          пикселей)
        </li>
        <li class="patch_notes__patch-feature">
          Добавлены значения минимальной ширины столбцов для таблиц с картами,
          теперь колонки никогда не перекрывают друг друга (включая иконки
          сортировки), при этом они полностью видны на вьюпортах full hd (1920
          пикселей), начиная с 1903 пикселей ширины экрана и меньше появляется
          горизонтальный ползунок, позволяющий смотреть не вмещающуюся таблицу
          вширь
        </li>
        <li class="patch_notes__patch-feature">
          Начиная с 768 пикселей и меньше (планшеты и телефоны) таблицы с
          картами адаптируются под свою мобильную версию, позволяя удобно
          смотреть карты с мобильных устройств
        </li>
      </ol>
    </li>
    <li class="patch-notes__patch-wrapper">
      <h3 class="patch-notes__patch-version">Версия 1.0.0</h3>
      <ol class="patch_notes__patch-features-wrapper">
        <li class="patch_notes__patch-feature">Создан проект</li>
        <li class="patch_notes__patch-feature">
          Добавлены все необходимые зависимости и настроены конфиги
        </li>
        <li class="patch_notes__patch-feature">
          Заранее подготовлены глобальные компоненты (картинки, модальные окна,
          спиннеры, переключатели)
        </li>
        <li class="patch_notes__patch-feature">
          Подготовлены стили и цвета для всего приложения, а также светлая и
          тёмная темы
        </li>
        <li class="patch_notes__patch-feature">
          Подготовлен роутер со всеми планируемыми страницами (главная,
          авторизация, регистрация, игроки, карты скиллсетов (21 скиллсет),
          конструктор тренировки, расписания качалочек, турниры и ростеры,
          баунти, 404 страница)
        </li>
        <li class="patch_notes__patch-feature">
          Реализована возможность авторизации/регистрации (пока не обязательно и
          ничего не даёт), где нужно указать почту (по которой если что можно
          сбросить пароль), пароль, а также osu! ник (будет использоваться в
          будущем)
        </li>
        <li class="patch_notes__patch-feature">
          Добавлено модальное окно, появляющееся при каждом новом патче,
          показывающее список последних обновлений
        </li>
        <li class="patch_notes__patch-feature">
          На страницах скиллсетов карт реализована таблица, которая динамически
          подгружает карты с базы данных, в которой можно сортировать и
          фильтровать карты (подгруженные карты кэшируются до обновления
          страницы, чтобы при переходе между разделами не нужно было подгружать
          их снова)
        </li>
        <li class="patch_notes__patch-feature">
          Обработаны сценарии ожидания загрузки данных, а также ошибочные
          сценарии
        </li>
        <li class="patch_notes__patch-feature">
          Добавлена возможность скопировать ID карты из таблицы в один клик
        </li>
        <li class="patch_notes__patch-feature">
          Добавлен компонент (а также написан запрос в базу), позволяющий быстро
          загружать в базу готовый список карт с помощью JSON-объектов
          (используется только в режиме разработки)
        </li>
        <li class="patch_notes__patch-feature">
          Приложение задеплоено на домен `https://botm-hub.web.app`
        </li>
      </ol>
    </li>
  </ul>
</template>

<style lang="scss" scoped>
.patch-notes {
  padding: 5px;
  display: flex;
  flex-direction: column;
  row-gap: 20px;
  &__patch-wrapper {
    .patch-notes__patch-version {
      @include default-headline(32px, 32px, var(--color-modal-text));
      margin-bottom: 10px;
      @media (max-width: $tablet-l) {
        font-size: 20px;
        line-height: 20px;
      }
    }
    .patch_notes__patch-features-wrapper {
      display: flex;
      flex-direction: column;
      row-gap: 10px;
      list-style-type: decimal;
      list-style-position: inside;
      .patch_notes__patch-feature {
        @include default-text(16px, 16px, var(--color-burger-menu-text));
        @media (max-width: $tablet-l) {
          font-size: 12px;
          line-height: 12px;
        }
      }
    }
  }
}
</style>
